# -*- mode: org; -*-

#+TITLE: Smart Documents
#+AUTHOR: Marius Peter
#+DATE: <2020-11-04 Wed>
#+EMAIL: blendoit@gmail.com
#+STARTUP: showall
#+SETUPFILE: ~/.emacs.d/templates/documents/default.org
#+INCLUDE: ~/.emacs.d/templates/documents/default.org_title

#+LATEX: \begin{abstract}
The idea of /Smart Documents/ came to me as I was reflecting on how to improve
the document creation process in my workplace. The GNU Emacs editor had
captured my imagination and I wanted to create an accessible and highly
productive text editor to benefit my organization. In this paper, I'll lay out
my vision for the /Smart Document/, a file containing both text destined to the
reader, and code describing how to update, validate, and present this text;
then, I'll weave my personal GNU Emacs customizations with a tutorial. This
paper is a /Smart Document/ itself!
#+LATEX: \end{abstract}

** Introduction

Phew, after all this initialization, I can finally introduce Org mode! I am so
*excited*.

Org mode replaces aword processor, a presentation creator, and a spreadsheet
editor. The spreadsheet ability captures more than 80% use cases wherein one
wishes to include a table in a text document destined for physical
publication. (It is clear that Excel spreadsheets are /not/ destined for
physical publication---simply attempt to print an Excel spreadsheet with the
default settings.)  In my opinion, Org mode matches all /useful/ features of
the Microsoft Office suite 1-to-1.

What follows are customizations designed to make Org mode behave more like
Microsoft Word. The end goal is, once again, to draw as many new users to Emacs
as possible!

Check out how much information Org mode keeps concerning the most recent
header:

#+NAME: org-meta-info
#+BEGIN_SRC emacs-lisp :tangle no :results pp :exports both :cache yes
(save-excursion
  (org-previous-visible-heading 1)
  (org-element-at-point))
#+END_SRC

#+RESULTS[cf28d310a45fa4e4dcd49882889cd36a2ae3820d]: org-meta-info
: (headline
:  (:raw-value "~org-mode~" :begin 15920 :end 23157
:   :pre-blank 1 :contents-begin 15935 :contents-end 23156
:   :level 2 :priority nil :tags nil
:   :todo-keyword nil :todo-type nil
:   :post-blank 1 :footnote-section-p nil
:   :archivedp nil :commentedp nil
:   :post-affiliated 15920 :title "~org-mode~"))

